{"data":{"markdownRemark":{"html":"<p>It's not a common problem, but it's a problem -- serving different SSL certs on one box for different domains.</p>\n<h2>The problem</h2>\n<p>As some of you may know from experience, you can only host one domain's SSL cert at a time on a single server. The reason being that you must first establish a secure connection before anything can happen, which happens by default with a browser over :443. Only one SSL cert can be used on a port, because nothing can happen until a secure connection has been established. This means the server is unaware of the context, other than a secure handshake is being requested over :443 and it is going to pass along the certificate for the next phase of the handshake.</p>\n<img src=\"/dist/images/blog/aws-multiple-ssl-certs/tls-handshake.png\" alt=\"TLS handshake\" />\n<p>Let's take a look at what a basic Apache SSL configured Virtual Host may look like:</p>\n<p>{% highlight html %}\nNameVirtualHost *:443\n<IfModule mod_ssl.so>\n&#x3C;VirtualHost *:443>\nServerName yourserver.com\nDocumentRoot /var/www/site\nSSLEngine on\nSSLCertificateFile ssl.crt\nSSLCertificateKeyFIle ssl.key\nSSLCertificateChainFile chain.crt\n</VirtualHost>\n</IfModule>\n{% endhighlight %}</p>\n<p>Unfortunately, we can not add any more Virtual Hosts to :443. Before Apache loads up the virtual host and serves anything, the handshake must have been successful -- meaning the certificate would have already been delivered and the connection has been established for the domain attached to :443. That means we cannot add another VirtualHost and let apache decide which SSL certificate to choose, as there's no context yet of what is being requested until the connection is securely established -- and then this information may be passed through it.</p>\n<h2>Server Name Indication</h2>\n<p>SNI is an extension to the SSL protocol (<a href=\"http://www.ietf.org/rfc/rfc4366.txt\" target=\"_blank\">RFC 4366</a>) changing the way the SSL handshake works. This allows for multiple host names to be servable over a single :443 port configuration. The way it works is by the client including the requested hostname in the first message during the handshake, which would allow Apache to determine which certificate it should use -- essentially which Virtual Host the request is for. Browsers must support this in order for it to work. However, this post is not about SNI, but the workaround without SNI. (<a href=\"http://en.wikipedia.org/wiki/Server_Name_Indication\" target=\"_blank\">More on SNI</a>)</p>\n<h2>Current Workaround</h2>\n<p>There's a nifty trick that can be done with Load Balancers on Amazon Web Services. The way the load balancer works is by sticking itself on the public facing end of your servers and handling all incoming traffic, and then forwarding it along to your server. So -- traffic coming in on :80 on the load balancer will be forwarded to :80 on an active instance of your web server. Port :443 requests will similarly come through the public facing load balancer, and forward along to your instance's :443 port.</p>\n<p>We've put a layer between the client and our server, so that means we can pretty much do whatever we want between the Load Balancer and the server... If we accept incoming traffic on <code>:443</code> on the Load Balancer, what if we forwarded it to port :*8443 on the server? Well, it'd work just like it did before, but we can guarantee browsers can communicate on :8443 because we have connections coming in on the load balancer over :443 and forwarding to :8443 on the server.</p>\n<p>This means we can set up a virtual host on <code>:8443</code> AND <code>:443</code>.</p>\n<p>Let's first look at how the Load Balancer works.</p>\n<img src=\"/dist/images/blog/aws-multiple-ssl-certs/load-balancer.jpg\" alt=\"load balancing\" />\n<p>The browser makes the request to a domain, which is pointing to the load balancer. The Load balancer is configured with the cert so it can establish the secure connection over <code>:443</code>, and then forwards the request with a secure connection to the server, over <code>:443</code> as well.</p>\n<p>Now let's assume we have 3 domains we want to serve securely from one server.</p>\n<img src=\"/dist/images/blog/aws-multiple-ssl-certs/dns-zones.jpg\" alt=\"three DNS zones\" />\n<p>We'll create a Load Balancer for each one of these domains to point to.</p>\n<img src=\"/dist/images/blog/aws-multiple-ssl-certs/dns-zones-lbs.jpg\" alt=\"three DNS zones mapped to three lbs\" />\n<p>And then finally, we'll configure each one of these Load Balancers to point to the server.</p>\n<img src=\"/dist/images/blog/aws-multiple-ssl-certs/dns-lb-proxy.jpg\" alt=\"DNS load balancer proxy\" />\n<p>As you notice in the diagram above, the Load Balancers are pointing to the server, but forwarding to a different port than the incoming traffic. Since each Load Balancer is separate from the other one -- each one of these Load Balancers can be configured with a SSL certificate specific to the Domain pointing to it. Then we can forward this request to a specific port on the server, and make the server listen on each one of these different ports.</p>\n<p>We now support 3 different scenarios:</p>\n<p>The user makes a request to Domain A, which is pointing to Load Balancer A, and finishes with a connection to the server on <code>:443</code> (LB) to <code>:443</code> (server).</p>\n<p>The user makes a request to Domain B, which is pointing to Load Balancer B, and finishes with a connection to the server on <code>:443</code> to <code>:8443</code>.</p>\n<p>The user makes a request to Domain C, which is pointing to Load Balancer C, and finishes with a connection to the server on <code>:443</code> to <code>:8444</code>.</p>\n<p>Assume the following configuration for Apache:</p>\n<p>{% highlight html %}\nNameVirtualHost *:443\n<IfModule mod_ssl.so>\n&#x3C;VirtualHost *:443>\nServerName domain<em>a.com\nDocumentRoot /var/www/site</em>a\nSSLEngine on\nSSLCertificateFile ssl<em>a.crt\nSSLCertificateKeyFIle ssl</em>a.key\nSSLCertificateChainFile chain.crt\n</VirtualHost></p>\n<p>  &#x3C;VirtualHost *:8443>\nServerName domain<em>b.com\nDocumentRoot /var/www/site</em>b\nSSLEngine on\nSSLCertificateFile ssl<em>b.crt\nSSLCertificateKeyFIle ssl</em>b.key\nSSLCertificateChainFile chain.crt\n</VirtualHost></p>\n<p>  &#x3C;VirtualHost *:8444>\nServerName domain<em>c.com\nDocumentRoot /var/www/site</em>c\nSSLEngine on\nSSLCertificateFile ssl<em>c.crt\nSSLCertificateKeyFIle ssl</em>c.key\nSSLCertificateChainFile chain.crt\n</VirtualHost>\n</IfModule>\n{% endhighlight %}</p>\n<p>Now apache has a different secure virtual host for each one of these new ports -- :443, :8443, and :8444 -- which can be any available port # of your choosing.</p>\n<p>The main idea here is that:</p>\n<ul>\n<li>The browser must connect to a <code>:443</code> port</li>\n<li>So we create a load balancer for each domain that accepts a <code>:443</code> port</li>\n<li>Apache cannot have multiple ssl certs on the same virtual host, so we split these up into their own ports</li>\n<li>We forward each of these load balancers to their respective port on the server</li>\n</ul>\n<p>Now we have a server that is capable of serving different domains with SSL certs by proxying secure connections over load balancers!</p>\n<h2>Setting up your DNS</h2>\n<p>There is one gotcha to all of this -- if you're going to be pointing an A record to a Load Balancer, an A record can only accept an IP address. So if you were to point \"domain<em>a.com\" to something, you'd have to use the IP address. \"www.domain</em>a.com\" can use a CNAME entry, and you can use the canonical name.</p>\n<p>AWS Load Balancers must be pointed to by their CNAME's, as their IPs are not static -- they frequently change. To get around this, Route 53 introduces Alias A records -- which is basically a CNAME, but a bit different in how it works. Alias records can point to the Load Balancers you have set up, so you can easily have you domain pointing to a non IP address. (<a href=\"http://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resource-record-sets-choosing-alias-non-alias.html\" target=\"_blank\">Route 53 Alias Record Sets</a>)</p>","frontmatter":{"date":"2014-08-20 12:34:00","permalink":"/blog/aws-multiple-ssl-certs","title":"Using AWS to serve multiple SSL certs on one server"}}},"pageContext":{}}